import Slide from './Slide.jsx'

export const slidesData = [
  {
    title: '1. โครงสร้างของเทอร์ไบน์',
    text: 'ภายในเฮ้าส์ซิ่ง ตัวเทอร์ไบน์จะมีลักษณะเป็นจากเกียร์ 2ชุด วางหันหน้าเข้าหาประกบกัน โดยจานเกียร์แต่ละอันจะมีใบพัดขึ้นรูปเป็นชิ้นเดียวกันมา วางตั้งฉากกับจานเกียร์ทั้งสอง และที่ขอบจานเกียร์จะส่งกำลังไปยังเพลาขับคู่ที่วางขนานอยู่ตรงกันข้ามกัน',
    imgSrc: 'images/assembly01.gif',
    imgAlt: 'การประกอบเครื่องยนต์',
  },  
  {
    title: '2. หลักการทำงานของเทอร์ไบน์',
    text: 'ใบมีดรูปครึ่งวงกลม 2ใบ วางเยื้องจุดศูนย์กลางการหมุน วางแยกจุดศูนย์กลางห่างกันในระยะที่พอเหมาะ ทำให้เกิดห้องกักเก็บแรงดันที่สามารถขยายตัวได้ด้วยการหมุนของใบมีดทั้งสองใบ ทำให้สามารถแปลงแรงดันของไอร้อนให้เป็นพลังงานกลได้ ข้อดี 1. ไอร้อนที่ออกมาจากกังหันมีแรงดันต่ำและระบายออกโดยไม่ต้องผ่านวาล์วอีก สามารถดึงพลังงานออกมาได้ใกล้เคียงกับค่าสูงสุดที่เป็นไปได้ 2. การเคลื่อนที่ของใบมีดทั้งสองเป็นไปในลักษณะเลื่อนไหลไปบนผิวหน้าด้านในของกันและกัน อีกทั้งแรงดันของไอร้อนจะพยายามผลักให้ใบมีดทั้งสองแยกออกจากกัน ดังนั้นจึงแทบจะไม่มีแรงเสียดทานอันเนื่องมาจากการทำงานของตัวกังหันเลย 3. การเคลื่อนที่ของใบมีดทั้งสองใบเป็นแบบหมุนรอบจุดศูนย์กลางการหมุน ทำให้สูญเสียพลังงานไปกับสั่นสะเทือนน้อยมาก 4. ไอร้อนภายในกังหันแทบจะไม่เคลื่อนที่ในทิศทางแนวเส้นรอบวงของแกนหมุน จึงสูญเสียพลังงานไปกับการเคลื่อนที่ของไอร้อนน้อยมาก 5. รูปทรงของใบมีดคู่ที่สมมาตรกันวางตัวทำมุมกัน 180องศา ทำให้หักล้างแรงสั่นสะเทือนที่เกิดขึ้นจากการหมุนของใบมีดทั้งสองใบได้อย่างสมบูรณ 6. การเคลื่อนที่ของใบมีดสม่ำเสมอและทิศทางเดียว ทำให้ความเครียดในวัศดุมีน้อย ขีดจำกัดของความเร็วรอบของกังหันจึงสูงมาก ขึ้นอยู้กับตัวแบริ่งและความแข็งแรงของวัสดุที่ใช้ทำใบมีด 7. ',
    imgSrc: 'images/concept.gif',
    imgAlt: 'แนวคิดการทำงานของเทอร์ไบน์',
  },
  {
    title: '3. ช่องทางไอร้อนแรงดันสูง เข้าสู่ห้องกักเก็บแรงดัน อยู่บริเวณกึ่งกลางระกว่างแกนหมุนของใบมีดทั้งสองใบ',
    text: 'ไอร้อนแรงดันสูงจะผ่านเข้ามาในห้องกักเก็บแรงดันแค่เพียงช่วงเวลาสั้นๆ ทำให้เกิดแรงดันสูงในห้องกักเก็บแรงดัน และเมื่อใบมีดทั้งสองใบหมุนผ่านช่องทางไอร้อนแรงดันสูงไปแล้ว แรงดันในห้องกักเก็บแรงดันจะลดลงอย่างรวดเร็วจนเหลือใกล้เคียงกับแรงดันบรรยากาศภายนอก กังหันนี้จึงสามารถที่จะดึงพลังงานออกมาได้ใกล้เคียงกับค่าสูงสุดที่เป็นไปได้',
    imgSrc: 'images/valve01.gif',
    imgAlt: 'วาล์ว',
  },
  {
    title: '4. การออกแบบ ตัวใบมีด',
    text: 'ตัวใบมีดทั้งสองใบเป็นแบบเดียวกัน มีลักษณะเป็นครึ่งวงกลม มีจุดศูนย์กลางการหมุนอยู่ที่ขอบของใบมีดทั้งสองใบ วางเยื้องจุดศูนย์กลางการหมุนห่างจากปลายใบมีด เป็นระยะ c ตัวใบมีดมีความหนาเป็นระยะ d และความสัมพันธ์ จะเป็น 2r = 4c + d เมื่อ r คือรัศมีของส่วนโค้งด้านในของใบมีด',
    imgSrc: 'images/BladeDesign01.jpg',
    imgAlt: 'ใบพัดเทอร์ไบน์',
  },
  {
    title: '5. ห้องเผาไหม้ และวาล์วบายพาส',
    text: 'ย้อนลงไปถัดจากช่องทางไอร้อนแรงดันสูง จะมีห้องเสองชั้น ชั้นนอกเป็นห้องแรงดันสูงซึ่งมีผนังหนารองรับแรงกดอากาศที่ต่างกันมากระหว่างภายนอกกับภายใน ชั้นในเป็นห้องเผาไหม้สร้างด้วยวัสดุที่ทนต่อความร้อนและมีวาล์วบายพาสอยู่ด้านข้างทำหน้าที่ปรับสัดส่วนการผสมระหว่างไอร้อนแรงดันสูงและอากาศแรงดันสูงปกติ ก่อนเข้าสู่กังหัน ชั่วยควบคุมอุณหภูมิและแรงดันของไอร้อนแรงดันสูงให้เหมาะสมกับการทำงานของกังหัน',
    imgSrc: 'images/chambervalve.gif',
    imgAlt: 'ห้องเผาและวาล์ว',
  },
  {
    title: '6. คอมเพรสเซอร์', 
    text: ' ทำหน้าที่ดูดอากาศปกติจากภายนอกเข้ามาบีบอัดให้มีแรงดันสูง เพื่อส่งต่อไปยังห้องเผาไหม้ คอมเพลสเซอร์แบบก้นหอยคู่ แยกแกนหมุน ผสานแนวคิดของคอมเพรสเซอร์แบบก้นหอยคู่ และแก้สเทอร์ไบนแบบขยายตัว ทำให้สามารถอัดอากาศปกติจากภายนอกได้อย่างต่อเนื่องโดยไม่ต้องใช้วาล์ว',
    imgSrc: 'images/pumpassembky.gif',
    imgAlt: 'การประกอบปั๊ม',
  },
  {
    title: '7. ความต่างในความเหมือน',
    text: 'คอมเพลสเซอร์แบบก้นหอยคู่แยกแกนหมุน แม้จะมีลักษณะคล้ายกับคอมเพรสเซอร์แบบก้นหอยคู่ แต่มีความแตกต่างกันในการทำงาน โดยคอมเพรสเซอร์แบบก้นหอยคู่แยกแกนหมุนจะทำงานด้วยการสร้างห้องกักเก็บอากาศที่แรงดันภายนอกปกติ ก่อนจะลดขนาดห้องให้เล็กลงอย่างต่อเนื่องโดยแทบจะไม่ทำให้อากาศเกิดการเคลื่อนที่ในทิศทางแนวเส้นรอบวงของแกนหมุน จึงสุญเสียพลังงานไปกับการถเคลื่อนที่ของอากาศน้อยมาก',
    imgSrc: 'images/pump.gif',
    imgAlt: 'ปั๊ม',
  },



]

export default function Presentation({ current }) {
  return (
    <>
      {slidesData.map((s, i) => (
        <Slide key={i} {...s} active={i === current} />
      ))}
    </>
  )
}
